{
  "west entrance": {
    "flavorText": "A torrent of air billows out around you as your bare feet pad their way past the still functioning automatic sliding doors.  Though some daylight still speckles the sky, dusk is approaching and any normal store in Capitalist RusUsa would have a flood of lights on specifically tuned to encourage your support of the oligarchinaires money vaults. No such luck today.  Despite the lack of light you can make out your two goals for entering the store.  Forward and to your LEFT is the pharmacy while forward and to your RIGHT is sporting goods.",
    "movement": {
      "north": "",
      "west": "",
      "south": "",
      "east": "discount bin"
    },
    "look": "Good choice, always perform a 5-point room scan, and don’t forget to double-tap. You see a shimmering slippery substance trailing deeper into the store that ends in a pool near you.  Sitting in that pool of i-don’t-wanna-know-what sits a NERF BLASTER.  Its just the basic model, but it looks like you might be able to mod it…",
    "search": "Just as with the EAST entrance, the area just inside the store has been picked clean by looters. Nothing useful here.\"",
    "move": "Wow, you really are brave, huh?  Are you sure you don’t want to LOOK around or PICK UP things nearby?"
  },
  "discount bin": {
    "flavorText": "$5.99 DVD's of '28 Days Later' and 'The Walking Dead'",
    "movement": {
      "north": "pharmacy",
      "west": "west entrance",
      "south": "sporting goods",
      "east": "east entrance"
    },
    "look": "$5.99 DVD's of '28 Days Later' and 'The Walking Dead'",
    "search": "$5.99 DVD's of '28 Days Later' and 'The Walking Dead'",
    "feature": ["list of zombies or special room features"],
    "roomLoot": ["nothing here"],
    "armoire": {
      "door 1": "",
      "chest 1": ""
    }
  },
  "pharmacy": {
    "flavorText": "bandaids and alcohol wipes",
    "movement": {
      "north": "",
      "west": "sporting goods",
      "south": "",
      "east": ""
    },
    "look": "you see some multi-colored loofas and realize you haven't showered since this all started... months ago",
    "search": "some listerine sparkles in the shadow of the mostly empty shelving",
    "feature": ["list of zombies or special room features"],
    "roomLoot": ["listerine"],
    "armoire": {
      "door 1": "",
      "chest 1": ""
    }
  },
  "sporting goods": {
    "flavorText": "knives and guns are sold out, but they have nerf gun springs and kerosene soaked nerf darts still!",
    "movement": {
      "north": "",
      "west": "",
      "south": "",
      "east": "pharmacy"
    },
    "look": "behind the glass counter is a sign that reads 'Yes, you must wear a mask to buy a gun' and 'NO, you do not need to show your face to finalize the purchase #murica'",
    "search": "seriously, there's no guns left",
    "feature": ["list of zombies or special room features"],
    "roomLoot": ["nothing here"],
    "armoire": {
      "door 1": "",
      "chest 1": ""
    }
  },
  "east entrance": {
    "flavorText": "You're approaching the light, but before you make it to the door a shadow shuffles into your path.",
    "movement": {
      "north": "",
      "west": "discount bin",
      "south": "",
      "east": "parking lot"
    },
    "look": "Sunken eyes and gaping mouth... if only you had some way to cover their mouth AND nose...",
    "search": "Just as with the WEST entrance, the area just inside the store has been picked clean by looters. Nothing useful here.",
    "feature": ["DOVIC shambler", "DOVIC walker", "DOVIC cougher"],
    "roomLoot": ["Hooah! bar"],
    "armoire": {
      "door 1": "",
      "chest 1": ""
    }
  }
}